sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
void nvs_write_sets(nvsApi nvs) {
	//sets.crc = crc8_le(0, (byte*)&sets, 3); log_d("%u, %02X", sets.alarm, sets.crc);
    esp_err_t ret = nvs_set_u32(nvs, NVS_KEY, reinterpret_cast<uint32_t&>(sets));
	if(ret == ESP_OK) { ret = nvs_commit(nvs); return; };
    CHECK_(ret);
}

void get_task_list(String& str) {
	auto num = uxTaskGetNumberOfTasks(); ESP_LOGD(TAG,"GetNumberOfTasks = %u", num);
	if (!str.reserve(num * 35)) return;
	char* const ptr = str.begin();
	vTaskList(ptr);
	reinterpret_cast<uint32_t*>(&str)[2] = strlen(ptr);
}

String get_info(bool ver) {
	uint32_t heap = ESP.getFreeHeap(); uint32_t sec = uS / 1000000;
	String str; str.reserve(400);
	str += "Connected to: "; str += WiFi.SSID(); str += "\nLocal IP: "; str += WiFi.localIP().toString(); str += "\nRSSI: "; str += WiFi.RSSI();
	str += "\nFree Heap: "; str += heap; str += "\nStack watermark:"; 
	str += "\nmain "; str += uxTaskGetStackHighWaterMark2(loopTaskHandle);
	str += "\nsend "; str += uxTaskGetStackHighWaterMark2(sendTaskHandle);
#ifdef CONFIG_GENERIC_LINE
	if(adcTaskHandle) {str += "\nadc "; str += uxTaskGetStackHighWaterMark2(adcTaskHandle);}
	if(ptr_curr_adc) { 
	str += "\nADC value "; str +=  *ptr_curr_adc;
	str += "\ngerkon_open_high = "; str += gerkon_open_high;
	str += "\ngerkon_close_high = "; str += gerkon_close_high;
	str += "\ngerkon_close_low = ";  str += gerkon_close_low;
	str += "\ngerkon_button_low = ";  str += gerkon_button_low;
	str += "\ngerkon_percent_drift = ";  str += gerkon_percent_drift;
	}
#endif
	//str += "\ninterrupt_delta =  "; str += interrupt_delta;
	//sets.relay = RELAY_STATE(dRead(PIN_RELAY));
	//str += "\nSettings 0x"; str += String(reinterpret_cast<uint32_t&>(sets), HEX);
	str += "\nSettings:\nalarm "; str += sets.alarm, str += "; proxima "; 
	str += sets.proxima; str += "; adc_line "; str += sets.adc_line; str += "; relay "; str += sets.relay;
	//str += "\nMode_";  str += sets.alarm; str += sets.proxima; str += sets.adc_line, str += sets.relay;
	if(sets.proxima/* last_interrupt != 0xFFFFFF */) { str += "\nlast_interrupt: "; str += last_interrupt; }
	str += "\nUptime: "; str += sec / 3600 / 24;  str += "d "; str += sec / 3600 % 24; str += "h "; str += sec / 60 % 60; str += "m "; str += sec % 60; str += "s";
	str += "\nUnix time: "; str += (unsigned)time(NULL);//(timestamp_unix + ((uS - time_sync_unix) / 1000000ul));
	if (ver) {
		if (img_state(false) == ESP_OTA_IMG_PENDING_VERIFY) { str += "\nESP_OTA_IMG_PENDING_VERIFY"; }
		const auto res = esp_reset_reason();
		if(res != ESP_RST_POWERON) { str += "\nReset_reason = "; str += res; }
		str += ("\nCompiled: " __TIMESTAMP__ "\n");
	} ESP_LOGD(FUN, "str.length ","%u", str.length());
	return str;
}

void init_sets() {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima && !timer_sab) {
		assert(timer_sab = timer_init(TIMER_SABOTAGE, sabotage_timer));
		assert(timer_intr = esp_timer_init([](void*) { enableInterrupt(PIN_LINE); } ));
		attachInterrupt(PIN_LINE, &isr_handler, GPIO_INTR_NEGEDGE);
	} else if(!sets.proxima && timer_sab) {
		Flag = RESTART;
		//detachInterrupt(PIN_LINE);
		//CHECK_(esp_timer_delete(timer_intr));
		//CHECK_(gptimer_stop(timer_sab));
		//CHECK_(gptimer_disable(timer_sab));
		//CHECK_(gptimer_del_timer(timer_sab));
		//timer_sab = NULL;
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line && !adc_handle) {
		init_adc_values();
		assert(xTaskCreate(adcReadTask, "adc", 2048, NULL, 2, &adcTaskHandle));
		adc_channel_t channel[] = { PIN_ADC_LINE }; int size = sizeof(channel)/sizeof(adc_channel_t);
		adc_handle = continuous_adc_init(conv_done_cb, channel, size, BUF_ADC_SIZE); 
		//ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
		gpio_config_t conf = { BIT(PIN_ADC_LINE) | BIT(PIN_ADC_PULLUP) | BIT(PIN_ADC_PULLUP2), GPIO_MODE_INPUT, GPIO_PULLUP_ENABLE };
	    gpio_config(&conf);
		//vTaskResume(adcTaskHandle);
	}
	else if (!sets.adc_line && adc_handle) {
		Flag = RESTART;
		//vTaskSuspend(adcTaskHandle);
		//CHECK_(adc_continuous_stop(adc_handle)); //error
		//CHECK_(adc_continuous_deinit(adc_handle));
		//adc_handle = NULL;
	}
#endif
}

void init_adc_values() { 
	gerkon_open_high = gerkon_open_def / 100.f * (100 + gerkon_percent_drift);
	gerkon_close_high = gerkon_close_def / 100.f * (100 + gerkon_percent_drift);
	gerkon_close_low = gerkon_close_def / 100.f * (100 - gerkon_percent_drift);
	gerkon_button_low = gerkon_button_def / 100.f * (100 - gerkon_percent_drift);
	ESP_LOGI(FUN, "open_high %u, close_high %u, close_low %u, adc_button_low %u", 
		gerkon_open_high, gerkon_close_high, gerkon_close_low, gerkon_button_low);
}

void alarm_on(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) {  enableInterrupt(PIN_LINE); timer_start_impl(); ESP_LOGI(FUN, ""); }
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 1;
	if (write) {  nvs_write_sets(); } 
#endif
}

void alarm_off(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) { 
		disableInterrupt(PIN_LINE); timer_stop_impl();  ESP_LOGI(FUN, "");
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 0;
	if (write) {  nvs_write_sets(); } 
#endif
}

void create_hex_string(String& str, cbyte* buf, cbyte data_size) {
	const size_t str_size = data_size * 3;
	if (!str.reserve(str_size)) return; //log_d("%u", str.isSSO());
	char* ptr = str.begin(); if(!ptr) { ESP_LOGD(FUN, "NULL"); return; }
	byte *field = reinterpret_cast<byte*>(&str) + (sizeof(String) -1); static_assert(sizeof(String) == 16);
	if(*field & 0x80) { *field = (str_size | 0x80); }// SSO
	else reinterpret_cast<uint32_t*>(&str)[2] = str_size;
	for (byte i = 0, shift, nibble, num;;*ptr++ = ' ') {
		for (shift = 4, num = buf[i];; shift = 0) {
			nibble = (num >> shift) & 0xF;
			*ptr++ = nibble < 10 ? nibble ^ 0x30 : nibble + ('A' - 10);
			if (shift == 0) break;
		} 
		if (++i >= data_size) break;
	}*ptr = '\0';
	ESP_LOGD(FUN,"str.length: %u, data_size: %u", str.length(), data_size);
}

